spec/data/stripe/customer.json

{
    "id": "cus_customer",
    "object": "customer",
    "account_balance": 0,
    "created": 1550617697,
    "currency": "usd",
    "default_source": "card_token",
    "delinquent": false,
    "description": null,
    "discount": null,
    "email": "brendandixon@me.com",
    "invoice_prefix": "16F25C8",
    "invoice_settings": {
        "custom_fields": null,
        "footer": null
    },
    "livemode": false,
    "metadata": {},
    "shipping": null,
    "sources": {
        "object": "list",
        "data": [
            {
                "id": "card_token",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "99999",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_customer",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 11,
                "exp_year": 2525,
                "fingerprint": "WNYxAz0PwPGHxzkc",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
            }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/customers/cus_customer/sources"
    },
    "subscriptions": {
        "object": "list",
        "data": [
            {
                "id": "sub_subscription",
                "object": "subscription",
                "application_fee_percent": null,
                "billing": "charge_automatically",
                "billing_cycle_anchor": 1550534400,
                "billing_thresholds": null,
                "cancel_at": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1550534400,
                "current_period_end": 1582156799,
                "current_period_start": 1550534400,
                "customer": "cus_customer",
                "days_until_due": null,
                "default_source": null,
                "discount": null,
                "ended_at": null,
                "items": {
                    "object": "list",
                    "data": [
                        {
                            "id": "si_subscription",
                            "object": "subscription_item",
                            "billing_thresholds": null,
                            "created": 1550534400,
                            "metadata": {},
                            "plan": {
                                "id": "plan_yearly_all",
                                "object": "plan",
                                "active": true,
                                "aggregate_usage": null,
                                "amount": 1000,
                                "billing_scheme": "per_unit",
                                "created": "2018-02-19T23:08:17.795Z",
                                "currency": "usd",
                                "interval": "year",
                                "interval_count": 1,
                                "livemode": false,
                                "metadata": {
                                    "recalls": "true",
                                    "vins": "2"
                                },
                                "nickname": "Yearly",
                                "product": "prod_my_recalls",
                                "tiers": null,
                                "tiers_mode": null,
                                "transform_usage": null,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "quantity": 1,
                            "subscription": "sub_subscription"
                        }
                    ],
                    "has_more": false,
                    "total_count": 1,
                    "url": "/v1/subscription_items?subscription=sub_subscription"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                    "id": "plan_yearly_all",
                    "object": "plan",
                    "active": true,
                    "aggregate_usage": null,
                    "amount": 1000,
                    "billing_scheme": "per_unit",
                    "created": "2018-02-19T23:08:17.795Z",
                    "currency": "usd",
                    "interval": "year",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {
                        "recalls": "true",
                        "vins": "2"
                    },
                    "nickname": "Yearly",
                    "product": "prod_my_recalls",
                    "tiers": null,
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                },
                "quantity": 1,
                "schedule": null,
                "start": 1550534400,
                "status": "active",
                "tax_percent": null,
                "trial_end": null,
                "trial_start": null
            }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/customers/cus_customer/subscriptions"
    },
    "tax_info": null,
    "tax_info_verification": null
}